// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19, 4, 76, 3 -> [1, 2, 5, 7, 19,4,76,3]
// 6, 1, 33, 43, 12, 3 ,2, 9 -> [6, 1, 33,43,12,3,2,9]
int [] GetArray(int size, int minValue, int maxValue)
{
    int[] res = new int[size];//-создаем массив с количеством пустых элементов
    for (int i=0; i<size; i++)
    {
        res[i] = new Random().Next(minValue,maxValue+1);
        Console.Write($"{res[i]} ");
    }
    return res;
}

int[] array = GetArray(8,-9,9);